events/API Call Events/issue.getAllForMethod/APIResponse - issue.getAllForMethod.xml

<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2" xmlns:wsa="http://www.w3.org/2005/08/addressing">
	<s:Header></s:Header>
	<s:Body>
		<wsnt:Notify>
			<wsnt:NotificationMessage>
				<wsnt:Topic></wsnt:Topic>
				<wsnt:ProducerReference>
					<wsa:Address>http://www.alert-project.eu/metadata</wsa:Address>
				</wsnt:ProducerReference>
				<wsnt:Message>
					<ns1:event xmlns:ns1="http://www.alert-project.eu/" xmlns:o="http://www.alert-project.eu/ontoevents-mdservice" xmlns:r="http://www.alert-project.eu/rawevents-forum" xmlns:r1="http://www.alert-project.eu/rawevents-mailinglist" xmlns:r2="http://www.alert-project.eu/rawevents-wiki" xmlns:s="http://www.alert-project.eu/strevents-kesi" xmlns:s1="http://www.alert-project.eu/strevents-keui" xmlns:s2="http://www.alert-project.eu/APIcall-request" xmlns:s3="http://www.alert-project.eu/APIcall-response" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.alert-project.eu/alert-root.xsd">
						<ns1:head>
							<ns1:sender>METADATASERVICE</ns1:sender>
							<ns1:timestamp>10000</ns1:timestamp>
							<ns1:sequencenumber>1</ns1:sequencenumber>
						</ns1:head>
						<ns1:payload>
							<ns1:meta>
								<ns1:startTime>10010</ns1:startTime>
								<ns1:endTime>10020</ns1:endTime>
								<!-- name of event -->
								<ns1:eventName>ALERT.Metadata.APICallResponse</ns1:eventName>
								<ns1:eventId>9856</ns1:eventId>
								<ns1:eventType>reply</ns1:eventType>
							</ns1:meta>
							<ns1:eventData>
								<ns1:apiResponse>
									<!-- name of method -->
									<s3:apiCall>issue.getAllForMethod</s3:apiCall>
									<s3:responseData>
                                                                                <s3:method>
                                                                                    <s3:methodUri>http://www.alert-project.eu/ontologies/alert.owl#Method1</s3:methodUri>
                                                                                    <s3:methodIssue>
                                                                                        <s3:issueUri>http://www.alert-project.eu/ontologies/alert_its.owl#Bug1</s3:issueUri>
                                                                                        <!-- relationLevel: 1 - direct with method, 2 - with method module, 3 - with method file, 4 - with method commit -->
                                                                                        <s3:relationLevel>1</s3:relationLevel>
                                                                                    </s3:methodIssue>
                                                                                    <s3:methodIssue>
                                                                                        <s3:issueUri>http://www.alert-project.eu/ontologies/alert_its.owl#Bug2</s3:issueUri>
                                                                                        <!-- relationLevel: 1 - direct with method, 2 - with method module, 3 - with method file, 4 - with method commit -->
                                                                                        <s3:relationLevel>3</s3:relationLevel>
                                                                                    </s3:methodIssue>
                                                                                </s3:method>
                                                                                <s3:method>
                                                                                    <s3:methodUri>http://www.alert-project.eu/ontologies/alert.owl#Method2</s3:methodUri>
                                                                                    <s3:methodIssue>
                                                                                        <s3:issueUri>http://www.alert-project.eu/ontologies/alert_its.owl#Bug3</s3:issueUri>
                                                                                        <!-- relationLevel: 1 - direct with method, 2 - with method module, 3 - with method file, 4 - with method commit -->
                                                                                        <s3:relationLevel>4</s3:relationLevel>
                                                                                    </s3:methodIssue>
                                                                                </s3:method>
                                                                                <s3:method>
                                                                                    <s3:methodUri>http://www.alert-project.eu/ontologies/alert.owl#Method3</s3:methodUri>
                                                                                </s3:method>
									</s3:responseData>
								</ns1:apiResponse>
							</ns1:eventData>
						</ns1:payload>
					</ns1:event>
				</wsnt:Message>
			</wsnt:NotificationMessage>
		</wsnt:Notify>
	</s:Body>
</s:Envelope>